app/Controllers/Activos.php

    public function entradaDeActivos(){
        if($this->session->has('idUsuario')){
            $this->type = "Entrada";
            $datos = [
                'permisos' => $this->permisoModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                 ->select('permisos.nombre')
                                                 ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                 ->orderBy('permisos.idPermiso', 'ASC')
                                                 ->findAll(),
                'titulo' => "Entrada de activos",
                'tipo' => "Entrada"
            ];
---
SELECT `permisos`.`nombre`
FROM `permisosusuario`
JOIN `permisos` ON `permisos`.`idPermiso` = `permisosusuario`.`idPermiso`
WHERE `permisosusuario`.`idUsuario` = '101'
ORDER BY `permisos`.`idPermiso` ASC

    public function salidaDeActivos(){
        if($this->session->has('idUsuario')){
            $this->type = "Salida";
            $datos = [
                'permisos' => $this->permisoModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                 ->select('permisos.nombre')
                                                 ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                 ->orderBy('permisos.idPermiso', 'ASC')
                                                 ->findAll(),
                'titulo' => "Salida de activos",
                'tipo' => "Salida"
            ];
---
SELECT `permisos`.`nombre`
FROM `permisosusuario`
JOIN `permisos` ON `permisos`.`idPermiso` = `permisosusuario`.`idPermiso`
WHERE `permisosusuario`.`idUsuario` = '101'
ORDER BY `permisos`.`idPermiso` ASC

                    echo json_encode($data);
                }
            }else{
                $datos = [
                    'permisos' => $this->permisoModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                 ->select('permisos.nombre')
                                                 ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                 ->orderBy('permisos.idPermiso', 'ASC')
                                                 ->findAll(),
                    'titulo' => "Registar activo nuevo",
                    'aplicaciones' => $this->aplicacionesModel->findAll()
                ];
---
SELECT `permisos`.`nombre`
FROM `permisosusuario`
JOIN `permisos` ON `permisos`.`idPermiso` = `permisosusuario`.`idPermiso`
WHERE `permisosusuario`.`idUsuario` = '21'
ORDER BY `permisos`.`idPermiso` ASC
SELECT *
FROM `aplicaciones`

    public function readDeleted(){
        if($this->request->isAJAX()){
            $buscar = $this->request->getPost('buscar');
            $pagina = $this->request->getPost('numpagina');
            $cantidad = 5;
            $inicio = ($pagina - 1) * 5;
            $datos = array(
                "activos" => $this->activosModel->select('activo.noActivo, activo.noSerie, activo.marca, activo.modelo, activo.fechaBaja, usuario.nombre, usuario.apellidoP, usuario.apellidoM')
                                                   ->join('usuario', 'activo.usuarioBaja = usuario.idUsuario')
                                                   ->like('noActivo', $buscar)
                                                   ->limit($cantidad, $inicio)
                                                   ->onlyDeleted()
                                                   ->find(),
                "cantidadActivos" => count($this->activosModel->like('noActivo', $buscar)->onlyDeleted()->findAll()),
            );
---
SELECT `activo`.`noActivo`, `activo`.`noSerie`, `activo`.`marca`, `activo`.`modelo`, `activo`.`fechaBaja`, `usuario`.`nombre`, `usuario`.`apellidoP`, `usuario`.`apellidoM`
FROM `activo`
JOIN `usuario` ON `activo`.`usuarioBaja` = `usuario`.`idUsuario`
WHERE `noActivo` LIKE '%%' ESCAPE '!'
AND `activo`.`fechaBaja` IS NOT NULL
 LIMIT 10
SELECT *
FROM `activo`
WHERE `noActivo` LIKE '%%' ESCAPE '!'
AND `activo`.`fechaBaja` IS NOT NULL

    public function update($id){
        if($this->session->has('idUsuario')){
            if($this->request->isAJAX()){
                $aplicaciones = json_decode($this->request->getPost('aplicaciones'),true);
                $idActivo = $this->request->getPost('idActivo');
                $datos = [
                    'marca' => $this->request->getPost('marca'),
                    'modelo' => $this->request->getPost('modelo'),
                    'memoriaRAM' => $this->request->getPost('memoriaRAM'),
                    'discoDuro' => $this->request->getPost('discoDuro'),
                    'procesador' => $this->request->getPost('procesador'),
                ];
                if($this->activosModel->update($idActivo, $datos)){
---
UPDATE `activo` SET `marca` = 'LENOVO', `modelo` = 'THINKPAD-231', `memoriaRAM` = '21312', `discoDuro` = '', `procesador` = '', `observaciones` = ''
WHERE `activo`.`idActivo` IN ('112')

                                                 ->orderBy('permisos.idPermiso', 'ASC')
                                                 ->findAll(),
                    'activo' => $this->activosModel->find($id),
                    'aplicaciones' => $this->aplicacionesModel->findAll(),
---
SELECT *
FROM `aplicaciones`