app/Controllers/Asignacion.php

SELECT `asignacion`.`idAsignacion`, `activo`.`noActivo`, `activo`.`marca`, `activo`.`modelo`, `asignacion`.`fechaAsignacion`, `asignacion`.`observaciones`
FROM `asignacion`
JOIN `activo` ON `asignacion`.`idAsignacion` = `activo`.`idAsignacion`
JOIN `usuario` ON `asignacion`.`usuarioAsignado` = `usuario`.`idUsuario`
WHERE `activo`.`noActivo` LIKE '%%' ESCAPE '!'
AND `asignacion`.`usuarioAsignado` = '21'
 LIMIT 5
SELECT `asignacion`.`idAsignacion`, `activo`.`noActivo`, `activo`.`marca`, `activo`.`modelo`, `asignacion`.`fechaAsignacion`, `asignacion`.`observaciones`
FROM `asignacion`
JOIN `activo` ON `asignacion`.`idAsignacion` = `activo`.`idAsignacion`
JOIN `usuario` ON `asignacion`.`usuarioAsignado` = `usuario`.`idUsuario`
WHERE `asignacion`.`usuarioAsignado` = '21'
---
    public function readActivo(){
        if($this->request->isAJAX()){
            $buscar = $this->request->getPost('buscar');
            $pagina = $this->request->getPost('numpagina');
            $cantidad = 5;
            $inicio = ($pagina - 1) * 5;
            $datos = array(
                "asignacion" => $this->asignacionModel->select('asignacion.idAsignacion, activo.noActivo, activo.marca, activo.modelo, asignacion.fechaAsignacion, asignacion.observaciones')
                                     ->join('activo', 'asignacion.idAsignacion = activo.idAsignacion')
                                     ->join('usuario', 'asignacion.usuarioAsignado = usuario.idUsuario')
                                     ->like('activo.noActivo', $buscar)
                                     ->where('asignacion.usuarioAsignado', $this->session->idUsuario)
                                     ->limit($cantidad, $inicio)
                                     ->find(),
                "cantidadAsignacion" => count($this->asignacionModel->select('asignacion.idAsignacion, activo.noActivo, activo.marca, activo.modelo, asignacion.fechaAsignacion, asignacion.observaciones')
                                                   ->join('activo', 'asignacion.idAsignacion = activo.idAsignacion')
                                                   ->join('usuario', 'asignacion.usuarioAsignado = usuario.idUsuario')
                                                   ->where('asignacion.usuarioAsignado', $this->session->idUsuario)
                                                   ->find())
            );