app/Controllers/Asignacion.php

    public function asignacionActivo($id){
        if(in_array('Asignar', array_column($this->session->permisos, 'nombre'))){
            $datos = [
                'permisos' => $this->permisoModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                 ->select('permisos.nombre')
                                                 ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                 ->orderBy('permisos.idPermiso', 'ASC')
                                                 ->findAll(),
                'activo' => $this->activosModel->find($id),
                'listaUsuarios' => $this->usuarioModel->select('idUsuario, CONCAT(nombre," ",apellidoP," ",apellidoM) as nombre')
                                                      ->findAll()
            ];
---
SELECT `permisos`.`nombre`
FROM `permisosusuario`
JOIN `permisos` ON `permisos`.`idPermiso` = `permisosusuario`.`idPermiso`
WHERE `permisosusuario`.`idUsuario` = '21'
ORDER BY `permisos`.`idPermiso` ASC

    public function reasignar($id){
        if(in_array('Asignar', array_column($this->session->permisos, 'nombre'))){
            if($this->request->isAJAX()){
                $this->asignacionModel->where('idActivo', $id)->delete();

                $datos = [
                    'usuarioAsigna' => $this->session->idUsuario,
                    'usuarioAsignado' => $this->request->getPost('usuarioAsignado'),
                    'idActivo' => $id,
                    'observaciones' => $this->request->getPost('observaciones')
                ];

                if($this->asignacionModel->save($datos)){
                    $idAsignacion = $this->asignacionModel->where('idActivo', $id)->findColumn('idAsignacion');
                    $this->activosModel->where('idActivo', $id)->set(['idAsignacion' => $idAsignacion[0]])->update();
---
UPDATE `activo` SET `idAsignacion` = '9'
WHERE `idActivo` = '8'
SELECT `idAsignacion`
FROM `asignacion`
WHERE `idActivo` = '8'

    public function readActivo(){
        if($this->request->isAJAX()){
            $buscar = $this->request->getPost('buscar');
            $pagina = $this->request->getPost('numpagina');
            $cantidad = 5;
            $inicio = ($pagina - 1) * 5;
            $datos = array(
                "asignacion" => $this->asignacionModel->select('asignacion.idAsignacion, activo.noActivo, activo.marca, activo.modelo, asignacion.fechaAsignacion, asignacion.observaciones')
                                     ->join('activo', 'asignacion.idAsignacion = activo.idAsignacion')
                                     ->join('usuario', 'asignacion.usuarioAsignado = usuario.idUsuario')
                                     ->like('activo.noActivo', $buscar)
                                     ->where('asignacion.usuarioAsignado', $this->session->idUsuario)
                                     ->limit($cantidad, $inicio)
                                     ->find(),
                "cantidadAsignacion" => count($this->asignacionModel->select('asignacion.idAsignacion, activo.noActivo, activo.marca, activo.modelo, asignacion.fechaAsignacion, asignacion.observaciones')
                                                   ->join('activo', 'asignacion.idAsignacion = activo.idAsignacion')
                                                   ->join('usuario', 'asignacion.usuarioAsignado = usuario.idUsuario')
                                                   ->where('asignacion.usuarioAsignado', $this->session->idUsuario)
                                                   ->find())
            );
---
SELECT `asignacion`.`idAsignacion`, `activo`.`noActivo`, `activo`.`marca`, `activo`.`modelo`, `asignacion`.`fechaAsignacion`, `asignacion`.`observaciones`
FROM `asignacion`
JOIN `activo` ON `asignacion`.`idAsignacion` = `activo`.`idAsignacion`
JOIN `usuario` ON `asignacion`.`usuarioAsignado` = `usuario`.`idUsuario`
WHERE `activo`.`noActivo` LIKE '%%' ESCAPE '!'
AND `asignacion`.`usuarioAsignado` = '21'
AND `asignacion`.`fechaBaja` IS NULL
 LIMIT 5