app/Controllers/Home.php

SELECT *
FROM `usuario`
WHERE `correo` = 'smadrigal4935@gmail.com'
---
    public function attemptLogin(){
        $email = trim($this->request->getPost('correo'));
        $contraseña = trim($this->request->getPost('contraseña'));

        $datosUsuario = $this->usuarioModel->where('correo', $email)->first();