app/Controllers/Permisos.php

    public function permisosUsuario($idUsuario){
        if($this->session->has('idUsuario')){
            $datos = [
                'permisos' => $this->permisoUModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                 ->select('permisos.nombre')
                                                 ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                 ->orderBy('permisos.idPermiso', 'ASC')
                                                 ->findAll(),
                'datosUsuario' => $this->usuarioModel->find($idUsuario),
                'datosPermisoUsuario' => $this->permisoUModel->where('idUsuario',$idUsuario)->findAll(),
                'listaPermisos' => $this->permisoModel->findAll(),
---
SELECT *
FROM `usuario`
WHERE `usuario`.`idUsuario` = '4'
SELECT *
FROM `permisosusuario`
WHERE `idUsuario` = '4'
SELECT *
FROM `permisos`