app/Controllers/Registrar.php

    public function registro(){
        $session = session();
        if(!$session->has('idUsuario')){
            if($this->request->isAJAX()){
                $datos = [
                    'curp' => $this->request->getPost('curp'),
                    'nombre' => $this->request->getPost('nombre'),
                    'apellidoP' => $this->request->getPost('apellidoP'),
                    'apellidoM' => $this->request->getPost('apellidoM'),
                    'puesto' => $this->request->getPost('puesto'),
                    'area' => $this->request->getPost('area'),
                    'correo' => $this->request->getPost('correo'),
                ];
                if($this->usuarioModel->save($datos)){
---
INSERT INTO `usuario` (`curp`, `nombre`, `apellidoP`, `apellidoM`, `puesto`, `area`, `correo`) VALUES ('MAFA971218HDFNNS05', 'Francisco Salvador', 'Peña', 'Madrigal', '2', '2', '16240691@leon.tecnm.mx')

    public function obtenerPuestos(){
        if($this->request->isAJAX()){
           $idArea = $this->request->getPost('idArea');

           $puestos = $this->puestoModel->where('idArea', $idArea)->findAll();
---
SELECT *
FROM `puestos`
WHERE `idArea` = '2'