app/Controllers/Reportes.php

SELECT `permisos`.`nombre`
FROM `permisosusuario`
JOIN `permisos` ON `permisos`.`idPermiso` = `permisosusuario`.`idPermiso`
WHERE `permisosusuario`.`idUsuario` = '21'
ORDER BY `permisos`.`idPermiso` ASC
---
    public function reporteActivos(){
        if(in_array('Reporte de activos', array_column($this->session->permisos, 'nombre'))) {
            $datos = [
                'permisos' => $this->permisoModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                    ->select('permisos.nombre')
                                                    ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                    ->orderBy('permisos.idPermiso', 'ASC')
                                                    ->findAll(),
                'tipo' => 'Eliminar',
                'uri' => service('uri'),
                'titulo' => 'Reporte de activos para TI'
            ];

SELECT `permisos`.`nombre`
FROM `permisosusuario`
JOIN `permisos` ON `permisos`.`idPermiso` = `permisosusuario`.`idPermiso`
WHERE `permisosusuario`.`idUsuario` = '21'
ORDER BY `permisos`.`idPermiso` ASC
---
    public function reporteBajas(){
        if(in_array('Reporte de bajas', array_column($this->session->permisos, 'nombre'))){
            $datos = [
                'permisos' => $this->permisoModel->where('permisosusuario.idUsuario',$this->session->idUsuario)
                                                    ->select('permisos.nombre')
                                                    ->join('permisos', 'permisos.idPermiso = permisosusuario.idPermiso')
                                                    ->orderBy('permisos.idPermiso', 'ASC')
                                                    ->findAll(),
                'tipo' => 'Eliminar',
                'uri' => service('uri'),
                'titulo' => 'Reporte de activos para TI'
            ];

SELECT `usuario`.`nombre`, `usuario`.`apellidoP`, `usuario`.`apellidoM`, `asignacion`.`fechaAsignacion`, `asignacion`.`observaciones`, `asignacion`.`fechaBaja`
FROM `asignacion`
JOIN `usuario` ON `asignacion`.`usuarioAsignado` = `usuario`.`idUsuario`
WHERE `asignacion`.`idActivo` = '7'
SELECT `aplicaciones`.`nombre`
FROM `activoaplicaciones`
JOIN `aplicaciones` ON `activoaplicaciones`.`idAplicacion` = `aplicaciones`.`idAplicacion`
WHERE `idActivo` = '7'
---
    public function generarReporteActivos(){
        if(in_array('Reporte de activos', array_column($this->session->permisos, 'nombre'))) {
            $activos = $this->activosModel->findAll();
            $inputFileName = 'templateActivos.xlsx';

            $reader = IOFactory::createReader('Xlsx');
            $spreadsheet = $reader->load($inputFileName);

            $contentStartRow = 10;
            $currentRow = 10;

            foreach($activos as $activo){
                $asignaciones = $this->asignacionModel->select('usuario.nombre, usuario.apellidoP, usuario.apellidoM, asignacion.fechaAsignacion, asignacion.observaciones, asignacion.fechaBaja')
                                                    ->join('usuario', 'asignacion.usuarioAsignado = usuario.idUsuario')
                                                    ->where('asignacion.idActivo', $activo['idActivo'])
                                                    ->withDeleted()
                                                    ->findAll();

                $aplicaciones = $this->aplicacionesModel->select('aplicaciones.nombre')
                                                        ->where('idActivo', $activo['idActivo'])
                                                        ->join('aplicaciones', 'activoaplicaciones.idAplicacion = aplicaciones.idAplicacion')
                                                        ->findAll();